        IDENTIFICATION DIVISION.
        PROGRAM-ID. "SCREEN SECTION".
        AUTHOR. Tengku Revino Buana Putra.
        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.

        SOURCE-COMPUTER. IBM-ATX.
        OBJECT-COMPUTER. IBM-ATX.
        SPECIAL-NAMES.

        INPUT-OUTPUT SECTION.
        FILE-CONTROL.

        DATA DIVISION.
        FILE SECTION.

        WORKING-STORAGE SECTION.
        01 NAMA PIC x(32).
        01 BILANGAN PIC X(30) VALUE " ".
        01 NPM PIC 9(8).
        01 ANGKA PIC 9(38) VALUE 0.
        01 PENENTU PIC 9(4).
        01 HASIL PIC Z(10).
        01 PILIHAN PIC X(1).

        SCREEN SECTION.

        01 CLEAR-SCREEN.
            02 BLANK SCREEN BACKGROUND-COLOR 1 FOREGROUND-COLOR 5.

        01 MENU-SCREEN AUTO.
            02 LINE 3 COLUMN 75 VALUE IS 'MENU :'.
            02 LINE 5 COLUMN 75 VALUE IS '1. GANJIL GENAP.'.
            02 LINE 6 COLUMN 75 VALUE IS '2. IDENTITAS.'.
            02 LINE 7 COLUMN 75 VALUE IS '3. KELUAR.'.
            02 LINE 8 COLUMN 75 VALUE IS 'PILIH NOMOR (1/2/3)?'.
            02 KOTAK-PILIHAN REVERSE-VIDEO PIC X(5)
            USING PILIHAN.

        01 INPUT-GANJILGENAP-SCREEN AUTO.
            02 LINE 3 COLUMN 75 VALUE IS 'GANJIL-GENAP (MAKS 4 DIGIT)'.
            02 LINE 5 COLUMN 75 VALUE IS '1. GANJIL GENAP.'.
            02 KOTAK-ANGKA REVERSE-VIDEO PIC X(10)
            USING ANGKA.

        01 INPUT-IDENTITAS-SCREEN AUTO.
            02 LINE 5 COLUMN 20 VALUE IS 'IDENTITAS:            '.
            02 LINE 7 COLUMN 20 VALUE IS 'NAMA (MAKS 32 DIGIT): '.
            02 KOTAK-NAMA REVERSE-VIDEO PIC X(32) 
            USING NAMA.
            02 LINE 8 COLUMN 20 VALUE IS 'NPM (MAKS 8 DIGIT):   '.
            02 KOTAK-NPM REVERSE-VIDEO PIC X(10)
            USING NPM.

        01 OUTPUT-GANJILGENAP-SCREEN AUTO.
            02 LINE 3 COLUMN 75 VALUE IS 'HASIL GANJIL-GENAP:'.

        PROCEDURE DIVISION.
        DISPLAY "Enter to start: " at 1010 .
        ACCEPT PILIHAN at 1033.
        
        100-MENU-MODULE.
        DISPLAY CLEAR-SCREEN.
        DISPLAY MENU-SCREEN.
        ACCEPT MENU-SCREEN.

        IF PILIHAN EQUAL 1 THEN
            GO TO 100-INPUT-GANJILGENAP-MODULE
        END-IF.
        IF PILIHAN EQUAL 2 THEN
            GO TO 100-INPUT-IDENTITAS-MODULE
        END-IF.
        IF PILIHAN EQUAL 3 THEN
            GO TO 9000-KELUAR
        ELSE
            DISPLAY "error"
            GO TO 100-MENU-MODULE
        END-IF.
        GO TO 100-MENU-MODULE.

        100-INPUT-GANJILGENAP-MODULE.
        DISPLAY CLEAR-SCREEN.
        DISPLAY INPUT-GANJILGENAP-SCREEN.
        ACCEPT INPUT-GANJILGENAP-SCREEN.
        PERFORM 8-KAKULASI VARYING PENENTU FROM 1 BY 1 UNTIL 
            PENENTU=-5.

        100-OUTPUT-GANJILGENAP-MODULE.
        DISPLAY CLEAR-SCREEN.
        DISPLAY OUTPUT-GANJILGENAP-SCREEN.
        
        100-INPUT-IDENTITAS-MODULE.
        DISPLAY CLEAR-SCREEN.
        DISPLAY INPUT-IDENTITAS-SCREEN.
        ACCEPT INPUT-IDENTITAS-SCREEN.
        DISPLAY CLEAR-SCREEN.
        DISPLAY " Nama " NAMA " dengan NPM " NPM AT 999999.
        GO TO 0-NOTHING.
        
        

        8-KAKULASI.
        IF ANGKA EQUAL 0 THEN
            DISPLAY "BILANGAN GENAP" at 999999
            GO TO 100-OUTPUT-GANJILGENAP-MODULE
        ELSE IF ANGKA EQUAL 1 OR ANGKA EQUAL -1 THEN
            DISPLAY "BILANGAN GANJIL" at 999999
            GO TO 100-OUTPUT-GANJILGENAP-MODULE
        END-IF.
        SUBTRACT 2 FROM ANGKA.

        0-NOTHING.
        DISPLAY " ".

        9000-KELUAR.
        STOP RUN.
